[
  {
    "name": "Bondi Beach",
    "location": "Sydney, Australia",
    "img": "assets/Icons/australia.png",
    "summary": "Sydney’s iconic surf beach, famous for its consistent waves, vibrant atmosphere, and golden sands. Great for all levels and always buzzing with energy.",
    "swell_hourly": [1.1, 1.3, 1.2, 1.4, 1.2, 1.0, 0.9],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [19, 19, 20, 20, 19, 18, 18],
    "temp_air": [22, 23, 24, 25, 23, 22, 21],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [14, 12, 10, 16, 13, 11, 9],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Bondi is great for all levels, from beginners to advanced surfers. The north end offers consistent right-handers, while the south end is popular with surf schools. The Bondi Boardriders club is active and friendly, and there are plenty of local cafes for a post-surf meal.",
    "crowds": "Very busy year-round, especially on weekends and public holidays. Early mornings (before 7am) and late evenings are the quietest. The beach attracts tourists, locals, and surf schools, so expect a mix of abilities in the water.",
    "facilities": "Lifeguards are present year-round. There are numerous cafes, restaurants, and bars along the promenade. Showers, restrooms, and lockers are available, and there is a skate park and playground nearby. Parking is metered and fills up quickly.",
    "hazards": "Strong rips at the southern end, especially during large swells or outgoing tides. Bluebottles can be present in summer. Always swim and surf between the flags, and be cautious of crowded conditions and beginners in the lineup.",
    "local_tips": "Sunrise sessions are less crowded and offer beautiful views. Try the Bondi Icebergs pool for a unique swim experience. For a quieter surf, check the far north corner or visit during weekdays. Local surf shops offer board rentals and lessons."
  },
  {
    "name": "Mundaka",
    "location": "Mundaka, Spain",
    "img": "assets/Icons/spain.png",
    "summary": "Legendary Basque river mouth with world-class lefts. Advanced surfers flock here for epic barrels and a unique European surf culture. The town itself is charming, with cobblestone streets and a vibrant local scene.",
    "swell_hourly": [1.3, 1.5, 1.7, 1.6, 1.4, 1.2, 1.0],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [17, 17, 18, 17, 16, 16, 16],
    "temp_air": [18, 19, 20, 19, 18, 17, 17],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [18, 20, 22, 19, 17, 15, 13],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "World-famous left-hand river mouth break, best for advanced surfers. Local surf clubs are welcoming but respect the lineup. Not suitable for beginners when the swell is big. The wave can offer rides of over 300 meters on a good day.",
    "crowds": "Can get crowded during good swells and weekends. Early mornings and weekdays are less busy. Local etiquette is strict—wait your turn and respect the locals. The lineup can be competitive, especially during contests.",
    "facilities": "Small parking area, showers, and restrooms available. Several surf shops and cafes in the village. Lifeguards present during peak season. The town offers a range of accommodation options, from hostels to boutique hotels.",
    "hazards": "Strong currents at the river mouth, especially on outgoing tides. Rocks and shallow sections at low tide. Watch for debris after heavy rain. The wave can be powerful and challenging, so know your limits.",
    "local_tips": "Best at mid to high tide. Watch the sandbar shape—it changes after storms. Try pintxos at a local bar after your session. Explore the old town and enjoy the local Basque cuisine. Bring a wetsuit, as water can be chilly even in summer."
  },
  {
    "name": "Jeffreys Bay",
    "location": "Jeffreys Bay, South Africa",
    "img": "assets/Icons/southafrica.png",
    "summary": "South Africa’s most famous right-hand point break, renowned for its long, fast walls and perfect barrels. A must-surf for any serious wave rider. The town is a hub for surf culture and wildlife enthusiasts.",
    "swell_hourly": [1.8, 2.0, 2.2, 2.1, 1.9, 1.7, 1.5],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [17, 17, 18, 17, 16, 16, 16],
    "temp_air": [20, 21, 22, 21, 20, 19, 18],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [20, 22, 24, 21, 19, 17, 15],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Best for advanced surfers, especially during winter swells. The Supertubes section offers some of the longest rides in the world. Local surf shops and pros are often seen in the lineup. The area is also great for wildlife watching and exploring the Eastern Cape.",
    "crowds": "Can get crowded during the winter season and surf contests. Early mornings and weekdays are less busy. Respect the locals and the pecking order. The vibe is competitive but friendly if you show respect.",
    "facilities": "Parking, showers, and restrooms available. Several surf shops, cafes, and accommodation options nearby. Lifeguards on duty during peak times. The town has supermarkets, restaurants, and medical facilities.",
    "hazards": "Strong currents, sharp rocks, and occasional sharks. Be cautious of heavy localism and respect the lineup. The wave can be powerful and fast, so paddle fitness is important.",
    "local_tips": "Best at mid to high tide with a solid SW swell. Bring a wetsuit—water can be chilly even in summer. Watch for dolphins sharing the lineup! Explore the local markets and try the seafood. Visit the surf museum for local history."
  },
  {
    "name": "Manu Bay",
    "location": "Raglan, New Zealand",
    "img": "assets/Icons/newzealand.png",
    "summary": "New Zealand’s legendary left-hand point break, famous for its long rides and stunning scenery. A classic destination for surfers seeking adventure. The surrounding area is lush and full of hiking trails.",
    "swell_hourly": [1.2, 1.4, 1.6, 1.5, 1.3, 1.1, 1.0],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [16, 16, 17, 16, 15, 15, 15],
    "temp_air": [17, 18, 19, 18, 17, 16, 15],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [14, 16, 18, 15, 13, 11, 10],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Great for intermediate to advanced surfers. The wave can run for hundreds of meters on a good day. Local surf schools offer lessons for beginners in smaller conditions. The area is also popular for camping and outdoor activities.",
    "crowds": "Popular with locals and traveling surfers, especially on weekends. The vibe is generally friendly, but be patient and wait your turn. Early mornings are less crowded, and the lineup is more relaxed during weekdays.",
    "facilities": "Parking lot above the point, basic restrooms, and picnic tables. Closest shops and cafes are in Raglan town. There are also hostels, motels, and campgrounds nearby. The town has a vibrant arts and music scene.",
    "hazards": "Rocky entry and exit—booties recommended. Strong rips on big days. Watch for submerged rocks at low tide. The wave can be fast and challenging for beginners.",
    "local_tips": "Best at mid tide with a SW swell and offshore winds. Enjoy the sunset from the point after your session. Respect the local surfers and the beautiful environment. Try the local coffee shops and explore the nearby waterfalls."
  },
  {
    "name": "Pipeline",
    "location": "Oahu, Hawaii, USA",
    "img": "assets/Icons/usa.png",
    "summary": "The Banzai Pipeline is Hawaii’s most famous and dangerous wave, known for its perfect barrels. The beach is iconic in surf culture and hosts major competitions every winter.",
    "swell_hourly": [2.5, 2.8, 3.0, 2.7, 2.6, 2.4, 2.2],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [25, 25, 25, 25, 25, 25, 25],
    "temp_air": [27, 28, 28, 27, 27, 26, 26],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [18, 20, 22, 19, 17, 15, 13],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "For experts only. Pipeline is world-famous for its heavy, hollow waves and perfect barrels. Watch out for the shallow reef. The wave is a proving ground for professional surfers and a bucket-list spot for many.",
    "crowds": "Extremely crowded during the winter season and surf contests. Respect the locals and the pecking order. The beach attracts photographers, spectators, and surfers from around the world.",
    "facilities": "Basic beach facilities. Lifeguards present during peak season. Food trucks and surf shops are nearby. Parking can be limited during big swells and contests.",
    "hazards": "Very shallow reef, strong currents, and heavy waves. Injuries are common, even for experienced surfers. Be aware of shorebreak and large sets.",
    "local_tips": "Watch the locals before paddling out. Early mornings are best for less wind. Bring reef booties and respect the local surf culture. Visit the nearby surf museum and enjoy the North Shore scenery."
  },
  {
    "name": "Teahupo o",
    "location": "Tahiti, French Polynesia",
    "img": "assets/Icons/france.png",
    "summary": "Tahiti’s Teahupo'o is world-renowned for its heavy, glassy barrels and thick reef break. The wave is both beautiful and dangerous, drawing elite surfers from around the globe.",
    "swell_hourly": [2.8, 3.0, 3.2, 3.1, 2.9, 2.7, 2.5],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [27, 27, 27, 27, 27, 27, 27],
    "temp_air": [29, 29, 30, 30, 29, 28, 28],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [12, 14, 16, 13, 11, 10, 9],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "For expert surfers only. Teahupo'o is famous for its thick, heavy barrels and shallow reef. The wave is a stop on the World Surf League tour and is considered one of the heaviest in the world.",
    "crowds": "Can get crowded during big swells and competitions. The lineup is dominated by locals and professionals during major events. Spectators often watch from boats in the channel.",
    "facilities": "Limited facilities. Boat access recommended. There are a few local guesthouses and surf camps. Bring your own supplies and be prepared for remote conditions.",
    "hazards": "Extremely shallow and sharp reef, heavy waves. Injuries are common, and rescue services may be limited. The wave breaks far from shore, so strong swimming skills are essential.",
    "local_tips": "Go with a local guide. Best during SW swells. Respect the local surfers and environment. Bring reef booties and plenty of sunscreen. Enjoy the stunning scenery and local hospitality."
  },
  {
    "name": "Snapper Rocks",
    "location": "Gold Coast, Australia",
    "img": "assets/Icons/australia.png",
    "summary": "Australia’s Gold Coast gem, famous for its long, fast right-handers and the Superbank. The area is vibrant and full of surf culture, with plenty of activities for visitors.",
    "swell_hourly": [1.5, 1.7, 1.9, 1.8, 1.6, 1.4, 1.2],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [23, 23, 23, 23, 23, 23, 23],
    "temp_air": [26, 27, 27, 26, 25, 25, 24],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [10, 12, 14, 13, 11, 9, 8],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "World-class right-hand point break, best during cyclone swells. The Superbank can link up for rides over a kilometer long. The area is also great for families and beachgoers.",
    "crowds": "Very crowded during good swells and weekends. Early mornings and late evenings are less busy. The lineup is competitive, especially during contests.",
    "facilities": "Good facilities, parking, showers, and cafes nearby. Surf shops and board rentals are available. The promenade is lined with restaurants and bars.",
    "hazards": "Strong currents and crowded lineups. Be cautious of drop-ins and collisions. The wave can be fast and powerful, especially on bigger days.",
    "local_tips": "Early mornings are best. Watch for sweep currents. Check the Superbank for connecting sections. Enjoy the local nightlife and explore nearby beaches."
  },
  {
    "name": "Hossegor",
    "location": "Hossegor, France",
    "img": "assets/Icons/france.png",
    "summary": "France’s surfing capital, known for its powerful beach breaks and world-class competitions. The town is lively, especially during the summer and contest season.",
    "swell_hourly": [1.8, 2.0, 2.2, 2.1, 1.9, 1.7, 1.5],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [19, 19, 20, 20, 19, 18, 18],
    "temp_air": [22, 23, 24, 25, 23, 22, 21],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [16, 18, 20, 19, 17, 15, 13],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Best for experienced surfers. Powerful beach breaks and hollow waves. The area hosts major surf contests and attracts top talent from around the world.",
    "crowds": "Busy during summer and competitions. Early mornings and off-season are quieter. The beach is popular with both locals and tourists.",
    "facilities": "Excellent facilities, surf shops, and restaurants. Plenty of accommodation options, from campsites to luxury hotels. Lifeguards are present during peak season.",
    "hazards": "Strong rips and shorebreak. The waves can be heavy and challenging, especially during big swells. Be cautious of shifting sandbanks.",
    "local_tips": "Check multiple peaks for best conditions. Explore the local markets and nightlife. Try the seafood restaurants and enjoy the vibrant town atmosphere."
  },
  {
    "name": "Trestles",
    "location": "California, USA",
    "img": "assets/Icons/usa.png",
    "summary": "Southern California’s premier high-performance wave, popular with pros and locals alike. The area is surrounded by natural beauty and is a favorite for surf photographers.",
    "swell_hourly": [1.2, 1.4, 1.6, 1.5, 1.3, 1.1, 1.0],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [18, 18, 19, 19, 18, 18, 17],
    "temp_air": [22, 23, 24, 23, 22, 21, 20],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [8, 10, 12, 11, 9, 8, 7],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Consistent, high-performance waves. Best with a SW swell. The wave is suitable for all levels, but the crowd is often advanced and competitive.",
    "crowds": "Always crowded, especially with good swell. Early mornings and weekdays are less busy. The lineup is a mix of locals, pros, and visiting surfers.",
    "facilities": "Limited facilities, long walk from parking. Bring water and snacks. There are restrooms at the trailhead and occasional food trucks.",
    "hazards": "Crowded lineups and cobblestone bottom. Be cautious of collisions and respect the local etiquette. The walk in and out can be long, so plan accordingly.",
    "local_tips": "Bring a bike for the trail. Early or late sessions are best. Watch for dolphins and enjoy the scenic walk through the reserve."
  },
  {
    "name": "Uluwatu",
    "location": "Bali, Indonesia",
    "img": "assets/Icons/indonesia.png",
    "summary": "Bali’s legendary left, set beneath dramatic cliffs, offering long rides and stunning sunsets. The area is rich in culture and offers a unique surf experience.",
    "swell_hourly": [1.7, 1.9, 2.1, 2.0, 1.8, 1.6, 1.4],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [28, 28, 28, 28, 28, 28, 28],
    "temp_air": [30, 31, 31, 30, 30, 29, 29],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [10, 12, 14, 13, 11, 10, 9],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Best for intermediate to advanced surfers. Long lefts and beautiful scenery. The area is also popular for yoga retreats and cliffside dining.",
    "crowds": "Busy during dry season and big swells. Early mornings and sunset sessions are less crowded. The lineup is a mix of locals, expats, and tourists.",
    "facilities": "Warungs, board rentals, and cliffside cafes. There are plenty of accommodation options, from budget hostels to luxury villas. Parking is available at the top of the cliffs.",
    "hazards": "Sharp reef and strong currents. Be cautious of low tide and exposed rocks. The paddle out can be challenging, especially for beginners.",
    "local_tips": "Check tide charts. Sunset sessions are magical. Explore the nearby temples and enjoy the local cuisine. Bring reef booties and plenty of water."
  },
  {
    "name": "Supertubos",
    "location": "Peniche, Portugal",
    "img": "assets/Icons/portugal.png",
    "summary": "Portugal’s Supertubos is famed for its heavy, hollow beach break barrels. The area is a hotspot for surf contests and attracts surfers from all over Europe.",
    "swell_hourly": [2.0, 2.2, 2.4, 2.3, 2.1, 1.9, 1.7],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [17, 17, 18, 18, 17, 17, 16],
    "temp_air": [20, 21, 22, 21, 20, 19, 18],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [16, 18, 20, 19, 17, 15, 13],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Heavy, hollow barrels. Best for experienced surfers. The wave is a regular stop on the World Surf League tour and is known for its power and intensity.",
    "crowds": "Busy during contests and autumn swells. Early mornings and off-season are quieter. The beach is popular with both locals and international visitors.",
    "facilities": "Parking, showers, and surf shops nearby. There are plenty of restaurants and bars in Peniche. Accommodation ranges from hostels to hotels.",
    "hazards": "Strong rips and heavy shorebreak. The wave can be dangerous, especially on big days. Be cautious of shifting sandbanks and strong currents.",
    "local_tips": "Best in autumn. Check wind direction. Explore the town of Peniche and try the local seafood. Bring a wetsuit, as water can be cool even in summer."
  },
  {
    "name": "Rincon",
    "location": "California, USA",
    "img": "assets/Icons/usa.png",
    "summary": "California’s ‘Queen of the Coast’, offering long, peeling right-hand point break waves. The area is scenic and popular with both surfers and beachgoers.",
    "swell_hourly": [1.3, 1.5, 1.7, 1.6, 1.4, 1.2, 1.0],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [16, 16, 17, 17, 16, 16, 15],
    "temp_air": [19, 20, 21, 20, 19, 18, 17],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [8, 10, 12, 11, 9, 8, 7],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Long, right-hand point break. Best with a west swell. The wave is suitable for all levels, but can get crowded during good conditions.",
    "crowds": "Very crowded during winter swells. Early mornings and weekdays are less busy. The lineup is a mix of locals, pros, and visitors.",
    "facilities": "Parking, restrooms, and showers. There are a few surf shops and cafes nearby. The area is family-friendly and has picnic spots.",
    "hazards": "Crowded lineups and rocky bottom. Be cautious of collisions and respect the local etiquette. The wave can be fast and challenging for beginners.",
    "local_tips": "Go early for best waves. Respect the locals. Enjoy the scenic drive along the coast and explore nearby beaches. Bring a wetsuit, as water can be cool year-round."
  },
  {
    "name": "Waimea Bay",
    "location": "Oahu, Hawaii, USA",
    "img": "assets/Icons/usa.png",
    "summary": "Oahu’s historic big wave spot, home to legendary surf contests and massive winter swells. The bay is beautiful and steeped in Hawaiian surf history.",
    "swell_hourly": [3.0, 3.2, 3.5, 3.3, 3.1, 2.9, 2.7],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [25, 25, 25, 25, 25, 25, 25],
    "temp_air": [27, 28, 28, 27, 27, 26, 26],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [14, 16, 18, 15, 13, 11, 10],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "For big wave surfers only. Famous for massive winter swells. The bay is the site of the Eddie Aikau Invitational, one of the most prestigious big wave events in the world.",
    "crowds": "Crowded during big swells and contests. The beach attracts spectators, photographers, and surfers from around the world. Off-season is quieter and suitable for swimming.",
    "facilities": "Parking, showers, and lifeguards. There are food trucks and restrooms nearby. The area is family-friendly and has picnic areas.",
    "hazards": "Huge waves, strong currents, and shorebreak. Only experienced surfers should paddle out during big swells. Be aware of changing conditions and respect the ocean.",
    "local_tips": "Only paddle out if you are experienced. Watch the Eddie contest if it runs. Visit the nearby Waimea Valley and enjoy the botanical gardens. Bring binoculars for whale watching in winter."
  },
  {
    "name": "Cloudbreak",
    "location": "Tavarua, Fiji",
    "img": "assets/Icons/fiji.png",
    "summary": "Fiji’s Cloudbreak is a powerful reef pass, delivering long, barreling lefts over shallow coral. The wave is world-famous and a dream destination for advanced surfers.",
    "swell_hourly": [2.2, 2.4, 2.6, 2.5, 2.3, 2.1, 1.9],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [28, 28, 28, 28, 28, 28, 28],
    "temp_air": [30, 31, 31, 30, 30, 29, 29],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [12, 14, 16, 13, 11, 10, 9],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Heavy, long lefts over shallow reef. For advanced surfers. The wave is a regular stop on the World Surf League tour and is known for its power and perfection.",
    "crowds": "Can get busy during big swells. The lineup is a mix of locals, pros, and visiting surfers. Early mornings and off-season are quieter.",
    "facilities": "Boat access, resorts nearby. There are surf camps and luxury accommodations on Tavarua and nearby islands. Meals and boat transfers are often included.",
    "hazards": "Shallow coral reef and strong currents. Injuries are common, so bring a first aid kit. The wave can be dangerous, especially on big days.",
    "local_tips": "Go with a boat. Best with SW swell and SE wind. Book accommodation in advance, as spots fill up quickly. Enjoy the island hospitality and explore the nearby reefs for snorkeling."
  },
  {
    "name": "Praia da Joaquina",
    "location": "Florianópolis, Brazil",
    "img": "assets/Icons/brazil.png",
    "summary": "A legendary Brazilian surf beach famous for its powerful waves, vibrant local scene, and beautiful sand dunes. Popular with both locals and international surfers, it's a great spot for intermediates and up.",
    "swell_hourly": [1.0, 1.2, 1.3, 1.4, 1.1, 0.9, 0.8],
    "swell_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "temp_water": [23, 23, 24, 24, 23, 22, 22],
    "temp_air": [25, 26, 27, 28, 26, 25, 24],
    "temp_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "wind_offshore": [8, 10, 12, 11, 9, 7, 6],
    "wind_onshore": [0, 0, 0, 0, 0, 0, 0],
    "wind_labels": ["MON", "TUE", "WED", "THU", "FRI", "SAT", "SUN"],
    "recommendation": "Recommended for intermediate and advanced surfers due to the consistent swell and punchy beach breaks. Local surf schools offer lessons for beginners, especially at the southern end. The beach is also a hotspot for sandboarding and beach volleyball.",
    "crowds": "Busy during weekends, holidays, and summer months. Early mornings (before 8am) are quieter. The lineup is friendly but can get competitive when the waves are good. Expect a lively atmosphere with music and food vendors.",
    "facilities": "Lifeguards on duty during the day. Large parking lot (paid), showers, restrooms, and several beachside bars and restaurants. Board rentals and surf schools are available. Public transport connects to downtown Florianópolis.",
    "hazards": "Strong rips, especially near the rocks and during big swells. Occasional jellyfish in summer. Be cautious of sun exposure and stay hydrated. Always surf between the flags and check local conditions.",
    "local_tips": "Best waves at mid to high tide. Try the local açaí bowls and fresh seafood at the beach kiosks. For a quieter session, check the far north end early in the morning. Sandboarding on the dunes is a must-try after your surf."
  }
]